# Exercises


#### The end product of these exercise is a jupyter notebook (classification_exercises.ipynb) and a acquire.py file. The notebook will contain all your work as you move through the exercises. The acquire.py file should contain the final functions that acquire the data into a pandas dataframe.

 1. Make a new repo called classification-exercises on both GitHub and within your codeup-data-science directory. This will be where you do your work for this module.

 2. Inside of your local classification-exercises repo, create a file named .gitignore with the following contents:


    env.py
    .DS_Store
    .ipynb_checkpoints/
    __pycache__
    *.csv
    *.xlsx
    
    Add and commit your .gitignore file before moving forward.

 3. Now that you are 100% sure that your .gitignore file lists env.py, create or copy your env.py file inside of classification-exercises. Running git status should show that git is ignoring this file.

 4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [16]:
import pandas as pd 
import acquire as acq
from env import get_db_url
# from pydataset import data
import os

In [2]:
os.getcwd()

'/Users/rosendo/codeup-data-science/classification-exercises'

In [3]:
# This is only to show how many tables you have in the database iris. 
# Create a query to join all the tables to you can have one big table 
# and add it to your def function inside the acquire.py file, so it 
# can pull all the tables a once. 
url = get_db_url('iris_db')
query = '''
show tables
'''
iris_tables = pd.read_sql(query, url)
iris_tables

  Tables_in_iris_db
0      measurements
1           species

In [6]:
df_iris = acq.get_iris_data()

creating df and exporting csv

In [7]:
df_iris

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...,...
145,3,146,6.7,3.0,5.2,2.3,virginica
146,3,147,6.3,2.5,5.0,1.9,virginica
147,3,148,6.5,3.0,5.2,2.0,virginica
148,3,149,6.2,3.4,5.4,2.3,virginica
149,3,150,5.9,3.0,5.1,1.8,virginica

#### 5.

In [ ]:
sheet_url = "https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357"

In [ ]:
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
csv_export_url

In [ ]:
df_google.head(3)

## 5.2

In [ ]:
df_google.shape

### 5.3

### 5.4

### 5.5

### 5.6

In [ ]:
df_google.nunique()

In [ ]:
df_google.info()

In [ ]:
for col in df_google.columns.to_list:
    if df_google[col].dtype == 'object':
        print(f"{col} has {df_google[col].nunique()} unique values.")

In [ ]:
df_google.select_dtypes('object').nunique()

In [ ]:
df_google.Survived.value_counts(dropna=False)

### 6.

In [ ]:
df_excel = pd.read_excel('train.xlsx', sheet_name = 'train')

In [ ]:
df_excel.info()

### 6.1

In [ ]:
df_excel_sample = df_excel.head(100)

In [ ]:
df_excel_sample.shape

### 6.2

In [ ]:
df_excel.shape[0]

In [ ]:
# df_excel.shape[0]

### 6.3

In [ ]:
# for this you need to use the square brackets
df_excel.columns[0:5]

In [ ]:
df_excel.columns[:5]

In [ ]:
df_excel.columns[:5].to_list()

### 6.4

In [ ]:
df_excel.select_dtypes('object').columns

In [ ]:
df_excel.select_dtypes('object').columns.to_list()

In [ ]:
df_excel.select_dtypes('object').head()

In [ ]:
df_excel.select_dtypes(exclude = 'object').columns.to_list()

In [ ]:
df_excel.select_dtypes(exclude = 'object').head()

### 6.5

In [ ]:
df_excel.head()

In [ ]:
df_excel[['Age', 'Fare']].describe()

In [ ]:
titanic_stats = df_excel[['Age', 'Fare']].describe().T

In [ ]:
titanic_stats

In [ ]:
titanic_stats['max'] - titanic_stats['min']

In [ ]:
titanic_stats['range'] = titanic_stats['max'] - titanic_stats['min'] 
titanic_stats

### A1.

In [ ]:
def get_db_url(db, user=user, password=password, host=host):
    return (f"mysql+pymysql://{user}:{password}@{host}/{db}")

In [ ]:
def titanic_data(SQL_query):
    '''
    This function will:
    - take in a SQL_query
    - create a connect_url to mySQL
    - return a df of the given query from the titanic_db
    '''
    url = get_db_url('titanic_db')
    return pd.read_sql(SQL_query, url)

In [ ]:
def get_titanic_data(SQL_query, directory, filename="titanic_csv"):
    '''
    This function will"
    - Check local directory for csv file
        - return id exists
    - If csv doesn't exists:
        - create a df of the SQL_query
        - write df to csv
    - Output titanic df
    '''
    if os.path.exists(directory + filename):
        df = pd.read_csv(filename)
        return df
    else:
        df = new_titanic_data(SQL_query)
        
        # want to save to csv 
        # if you want to change where to save your file change your directory
        df.to_csv(directory + filename) 
        return df

In [ ]:
titanic_query = 'select * from passengers'
directroy = os.getcdw()

In [ ]:
titanic_df = get_titanic_data(titanic_query, directory)

In [ ]:
titanic_df.head()

### A2.

In [ ]:
def iris_data(SQL_query):
    '''
    This function will:
    - take in a SQL_query
    - create a connect_url to mySQL
    - return a df of the given query from the iris_db
    '''
    url = get_db_url('iris_db')
    return pd.read_sql(SQL_query, url)

In [ ]:
def get_iris_data(SQL_query, directory, filename="iris_csv"):
    '''
    This function will
    - Check local directory for csv file
        - return id exists
    - If csv doesn't exists:
        - create a df of the SQL_query
        - write df to csv
    - Output iris df
    '''
    if os.path.exists(directory + filename):
        df = pd.read_csv(filename)
        return df
    else:
        df = iris_data(SQL_query)
        
        # want to save to csv 
        # if you want to change where to save your file change your directory
        df.to_csv(directory + filename) 
        return df

In [ ]:
iris_query = """

"""

### A3.

In [ ]:
def telco_churn_data(SQL_query):
    '''
    This function will:
    - take in a SQL_query
    - create a connect_url to mySQL
    - return a df of the given query from the telco_churn
    '''
    url = get_db_url('telco_churn')
    return pd.read_sql(SQL_query, url)

In [ ]:
def get_telco_churn_data(SQL_query, directory, filename="telco_churn_csv"):
    '''
    This function will
    - Check local directory for csv file
        - return id exists
    - If csv doesn't exists:
        - create a df of the SQL_query
        - write df to csv
    - Output telco churn df
    '''
    if os.path.exists(directory + filename):
        df = pd.read_csv(filename)
        return df
    else:
        df = telco_churn_data(SQL_query)
        
        # want to save to csv 
        # if you want to change where to save your file change your directory
        df.to_csv(directory + filename) 
        return df

In [ ]:
telco_churn_query = """
select *
from customers
join contract
"""

### A4.

In [26]:
import acquire as acq

In [27]:
acq.get_iris_data(iris_query, directory)

NameError: name 'iris_query' is not defined

In [28]:
acq.get_telco_churn(telco_churn, directory)

AttributeError: module 'acquire' has no attribute 'get_telco_churn'

# DATA PREPARATION

## Exercises

The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

In [47]:
import acquire as acq
import pandas as pd 
import os

from sklearn.model_selection import train_test_split

## Using the Iris Data:

    1. Use the function defined in acquire.py to load the iris data.

In [48]:
df_iris = acq.get_iris_data()

csv file found and loaded

In [49]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 0 to 149
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   species_id      150 non-null    int64
 1   measurement_id  150 non-null    int64
 2   sepal_length    150 non-null    float64
 3   sepal_width     150 non-null    float64
 4   petal_length    150 non-null    float64
 5   petal_width     150 non-null    float64
 6   species_name    150 non-null    object
dtypes: float64(4), int64(2), object(1)
memory usage: 9.4+ KB

In [50]:
df_iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

    2. Drop the species_id and measurement_id columns.

In [51]:
df_iris = df_iris.drop(columns = 'species_id')

In [52]:
df_iris.head()

,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,5.1,3.5,1.4,0.2,setosa
1,2,4.9,3.0,1.4,0.2,setosa
2,3,4.7,3.2,1.3,0.2,setosa
3,4,4.6,3.1,1.5,0.2,setosa
4,5,5.0,3.6,1.4,0.2,setosa

In [53]:
df_iris = df_iris.drop(columns = 'measurement_id')

In [54]:
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

    3. Rename the species_name column to just species.

In [55]:
df_iris = df_iris.rename(columns={'species_name': 'species'})

In [56]:
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

    4. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [57]:
# Just looking at the species column
df_iris.species

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [58]:
# looking at the species data
df_iris.species.head()

0    setosa
1    setosa
2    setosa
3    setosa
4    setosa
Name: species, dtype: object

In [59]:
# use get_dummies on species data
pd.get_dummies(df_iris.species).head()

   setosa  versicolor  virginica
0       1           0          0
1       1           0          0
2       1           0          0
3       1           0          0
4       1           0          0

In [60]:
# creating dummy variables for 'species'
dummy_df = pd.get_dummies(df_iris.species, drop_first=True)
dummy_df.head()

   versicolor  virginica
0           0          0
1           0          0
2           0          0
3           0          0
4           0          0

In [61]:
# concatenate the dummy_df dataframe above with the original df and validate.
df_iris = pd.concat([df_iris, dummy_df], axis=1)

In [62]:
df_iris.head(10)

,sepal_length,sepal_width,petal_length,petal_width,species,versicolor,virginica
0,5.1,3.5,1.4,0.2,setosa,0,0
1,4.9,3.0,1.4,0.2,setosa,0,0
2,4.7,3.2,1.3,0.2,setosa,0,0
3,4.6,3.1,1.5,0.2,setosa,0,0
4,5.0,3.6,1.4,0.2,setosa,0,0
5,5.4,3.9,1.7,0.4,setosa,0,0
6,4.6,3.4,1.4,0.3,setosa,0,0
7,5.0,3.4,1.5,0.2,setosa,0,0
8,4.4,2.9,1.4,0.2,setosa,0,0
9,4.9,3.1,1.5,0.1,setosa,0,0

In [66]:
df_iris.species.versicolor.unique()

AttributeError: 'Series' object has no attribute 'versicolor'

In [64]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 0 to 149
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
 5   versicolor    150 non-null    uint8
 6   virginica     150 non-null    uint8
dtypes: float64(4), object(1), uint8(2)
memory usage: 7.3+ KB

In [4]:
df_iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

    5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [5]:
def prep_iris(df_iris):
    '''
    This function prepares the iris data by dropping the species_id and measurement_id.
    It also renames the species_name column to species and creates a dummies for the
    column species and at the end concats the dummy species columns with the iris database
    '''
    df_iris = df_iris.drop(columns = ['species_id', 'measurement_id'])
    df_iris = df_iris.rename(columns={'species_name': 'species'})
    dummy_df = pd.get_dummies(df_iris[['species']])
    df_iris = pd.concat([df_iris, dummy_df], axis=1)
    return df_iris

In [6]:
df_iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

In [7]:
prep_iris(df_iris)

,sepal_length,sepal_width,petal_length,petal_width,species,species_setosa,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0
1,4.9,3.0,1.4,0.2,setosa,1,0,0
2,4.7,3.2,1.3,0.2,setosa,1,0,0
3,4.6,3.1,1.5,0.2,setosa,1,0,0
4,5.0,3.6,1.4,0.2,setosa,1,0,0
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,1
146,6.3,2.5,5.0,1.9,virginica,0,0,1
147,6.5,3.0,5.2,2.0,virginica,0,0,1
148,6.2,3.4,5.4,2.3,virginica,0,0,1
149,5.9,3.0,5.1,1.8,virginica,0,0,1

### Using the Titanic dataset

    1. Use the function defined in acquire.py to load the Titanic data.

In [8]:
df_titanic = acq.get_titanic_data()

csv file found and loaded

In [9]:
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

    2. Drop any unnecessary, unhelpful, or duplicated columns.

In [13]:
df_titanic = df_titanic.drop(columns='embark_town')

In [14]:
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,1

In [15]:
df_titanic = df_titanic.drop(columns='class')

In [16]:
df_titanic

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,alone
0,0,0,3,male,22.0,1,0,7.2500,S,NaN,0
1,1,1,1,female,38.0,1,0,71.2833,C,C,0
2,2,1,3,female,26.0,0,0,7.9250,S,NaN,1
3,3,1,1,female,35.0,1,0,53.1000,S,C,0
4,4,0,3,male,35.0,0,0,8.0500,S,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,NaN,1
887,887,1,1,female,19.0,0,0,30.0000,S,B,1
888,888,0,3,female,NaN,1,2,23.4500,S,NaN,0
889,889,1,1,male,26.0,0,0,30.0000,C,C,1
890,890,0,3,male,32.0,0,0,7.7500,Q,NaN,1

In [17]:
df_titanic = df_titanic.drop(columns='age')

In [18]:
df_titanic

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,deck,alone
0,0,0,3,male,1,0,7.2500,S,NaN,0
1,1,1,1,female,1,0,71.2833,C,C,0
2,2,1,3,female,0,0,7.9250,S,NaN,1
3,3,1,1,female,1,0,53.1000,S,C,0
4,4,0,3,male,0,0,8.0500,S,NaN,1
...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,S,NaN,1
887,887,1,1,female,0,0,30.0000,S,B,1
888,888,0,3,female,1,2,23.4500,S,NaN,0
889,889,1,1,male,0,0,30.0000,C,C,1
890,890,0,3,male,0,0,7.7500,Q,NaN,1

In [19]:
df_titanic = df_titanic.drop(columns='deck')

In [20]:
df_titanic

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone
0,0,0,3,male,1,0,7.2500,S,0
1,1,1,1,female,1,0,71.2833,C,0
2,2,1,3,female,0,0,7.9250,S,1
3,3,1,1,female,1,0,53.1000,S,0
4,4,0,3,male,0,0,8.0500,S,1
...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,S,1
887,887,1,1,female,0,0,30.0000,S,1
888,888,0,3,female,1,2,23.4500,S,0
889,889,1,1,male,0,0,30.0000,C,1
890,890,0,3,male,0,0,7.7500,Q,1

In [21]:
#fill it!
# We could fill embarked with most common value, 'Southampton', by hard-coding the value using the fillna() function
df_titanic.embarked = df_titanic.embarked.fillna(value='S')

In [22]:
df_titanic.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone
0,0,0,3,male,1,0,7.2500,S,0
1,1,1,1,female,1,0,71.2833,C,0
2,2,1,3,female,0,0,7.9250,S,1
3,3,1,1,female,1,0,53.1000,S,0
4,4,0,3,male,0,0,8.0500,S,1

    3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [24]:
# create dummy variables for 'sex' and 'embarked'
pd.get_dummies(df_titanic[['sex', 'embarked']]).head()

   sex_female  sex_male  embarked_C  embarked_Q  embarked_S
0           0         1           0           0           1
1           1         0           1           0           0
2           1         0           0           0           1
3           1         0           0           0           1
4           0         1           0           0           1

In [26]:
dummy_df = pd.get_dummies(df_titanic[['sex','embarked']], drop_first=True)

In [27]:
dummy_df

     sex_male  embarked_Q  embarked_S
0           1           0           1
1           0           0           0
2           0           0           1
3           0           0           1
4           1           0           1
..        ...         ...         ...
886         1           0           1
887         0           0           1
888         0           0           1
889         1           0           0
890         1           1           0

[891 rows x 3 columns]

In [28]:
# concatenate the dummy_df dataframe above with the original df and validate.
df_titanic = pd.concat([df_titanic, dummy_df], axis=1)

In [29]:
df_titanic.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone,sex_male,embarked_Q,embarked_S
0,0,0,3,male,1,0,7.2500,S,0,1,0,1
1,1,1,1,female,1,0,71.2833,C,0,0,0,0
2,2,1,3,female,0,0,7.9250,S,1,0,0,1
3,3,1,1,female,1,0,53.1000,S,0,0,0,1
4,4,0,3,male,0,0,8.0500,S,1,1,0,1

    4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [2]:
df_titanic = acq.get_titanic_data()

csv file found and loaded

In [10]:
# This will clean the data. 
def prep_titanic(df_titanic):
    '''
    This function will clean the the titanic dataset
    '''
    df_titanic = df_titanic.drop(columns =['embark_town','class','age','deck'])

    df_titanic.embarked = df_titanic.embarked.fillna(value='S')

    dummy_df = pd.get_dummies(df_titanic[['sex','embarked']], drop_first=True)
    df_titanic = pd.concat([df_titanic, dummy_df], axis=1)
    return df_titanic

In [ ]:
fresh_titanic = acq.get_titanic.data

In [11]:
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [12]:
prep_titanic(df_titanic)

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone,sex_male,embarked_Q,embarked_S
0,0,0,3,male,1,0,7.2500,S,0,1,0,1
1,1,1,1,female,1,0,71.2833,C,0,0,0,0
2,2,1,3,female,0,0,7.9250,S,1,0,0,1
3,3,1,1,female,1,0,53.1000,S,0,0,0,1
4,4,0,3,male,0,0,8.0500,S,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,0,0,13.0000,S,1,1,0,1
887,887,1,1,female,0,0,30.0000,S,1,0,0,1
888,888,0,3,female,1,2,23.4500,S,0,0,0,1
889,889,1,1,male,0,0,30.0000,C,1,1,0,0
890,890,0,3,male,0,0,7.7500,Q,1,1,1,0

# Using the Telco dataset

    1. Use the function defined in acquire.py to load the Telco data.

In [67]:
df_telco = acq.get_telco_data()

csv file found and loaded

In [68]:
df_telco.head().T

,0,1,2,3,4
payment_type_id,2,2,1,1,2
internet_service_type_id,1,1,2,2,2
contract_type_id,2,1,1,1,1
customer_id,0002-ORFBO,0003-MKNFE,0004-TLHLJ,0011-IGKFF,0013-EXCHZ
gender,Female,Male,Male,Male,Female
senior_citizen,0,0,0,1,1
partner,Yes,No,No,Yes,Yes
dependents,Yes,No,No,No,No
tenure,9,9,4,13,3
phone_service,Yes,Yes,Yes,Yes,Yes
multiple_lines,No,Yes,No,No,No
online_security,No,No,No,No,No
online_backup,Yes,No,No,Yes,No
device_protection,No,No,Yes,Yes,No
tech_support,Yes,No,No,No,Yes
streaming_tv,Yes,No,No,Yes,Yes
streaming_movies,No,Yes,No,Yes,No
paperless_billing,Yes,No,Yes,Yes,Yes
monthly_charges,65.6,59.9,73.9,98.0,83.9
total_charges,593.3,542.4,280.85,1237.85,267.4
churn,No,No,Yes,Yes,Yes
contract_type,One year,Month-to-month,Month-to-month,Month-to-month,Month-to-month
internet_service_type,DSL,DSL,Fiber optic,Fiber optic,Fiber optic
payment_type,Mailed check,Mailed check,Electronic check,Electronic check,Mailed check

    2. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [69]:
df_telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   payment_type_id           7043 non-null   int64
 1   internet_service_type_id  7043 non-null   int64
 2   contract_type_id          7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  contract_type             7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [70]:
df_telco.multiple_lines.value_counts()

No                  3390
Yes                 2971
No phone service     682
Name: multiple_lines, dtype: int64

In [72]:
# Don't forget to do this part
for col in df_telco.columns:
    print(df_telco[col].value_counts())

1    2365
2    1612
3    1544
4    1522
Name: payment_type_id, dtype: int64
2    3096
1    2421
3    1526
Name: internet_service_type_id, dtype: int64
1    3875
3    1695
2    1473
Name: contract_type_id, dtype: int64
0002-ORFBO    1
6616-AALSR    1
6625-UTXEW    1
6625-IUTTT    1
6625-FLENO    1
             ..
3352-RICWQ    1
3352-ALMCK    1
3351-NQLDI    1
3351-NGXYI    1
9995-HOTOH    1
Name: customer_id, Length: 7043, dtype: int64
Male      3555
Female    3488
Name: gender, dtype: int64
0    5901
1    1142
Name: senior_citizen, dtype: int64
No     3641
Yes    3402
Name: partner, dtype: int64
No     4933
Yes    2110
Name: dependents, dtype: int64
1     613
72    362
2     238
3     200
4     176
     ...
28     57
39     56
44     51
36     50
0      11
Name: tenure, Length: 73, dtype: int64
Yes    6361
No      682
Name: phone_service, dtype: int64
No                  3390
Yes                 2971
No phone service     682
Name: multiple_lines, dtype: int64
No                     3498
Yes                    2019
No internet service    1526
Name: online_security, dtype: int64
No                     3088
Yes                    2429
No internet service    1526
Name: online_backup, dtype: int64
No                     3095
Yes                    2422
No internet service    1526
Name: device_protection, dtype: int64
No                     3473
Yes                    2044
No internet service    1526
Name: tech_support, dtype: int64
No                     2810
Yes                    2707
No internet service    1526
Name: streaming_tv, dtype: int64
No                     2785
Yes                    2732
No internet service    1526
Name: streaming_movies, dtype: int64
Yes    4171
No     2872
Name: paperless_billing, dtype: int64
20.05     61
19.85     45
19.95     44
19.90     44
20.00     43
          ..
116.55     1
106.85     1
68.55      1
108.80     1
67.85      1
Name: monthly_charges, Length: 1585, dtype: int64
           11
20.2       11
19.75       9
19.9        8
20.05       8
           ..
2387.75     1
6302.8      1
2058.5      1
829.55      1
3707.6      1
Name: total_charges, Length: 6531, dtype: int64
No     5174
Yes    1869
Name: churn, dtype: int64
Month-to-month    3875
Two year          1695
One year          1473
Name: contract_type, dtype: int64
Fiber optic    3096
DSL            2421
None           1526
Name: internet_service_type, dtype: int64
Electronic check             2365
Mailed check                 1612
Bank transfer (automatic)    1544
Credit card (automatic)      1522
Name: payment_type, dtype: int64

In [73]:
pd.crosstab(df_telco.payment_type, df_telco.payment_type_id)

payment_type_id               1     2     3     4
payment_type
Bank transfer (automatic)     0     0  1544     0
Credit card (automatic)       0     0     0  1522
Electronic check           2365     0     0     0
Mailed check                  0  1612     0     0

In [77]:
pd.crosstab(df_telco.contract_type, df_telco.contract_type)

contract_type   Month-to-month  One year  Two year
contract_type
Month-to-month            3875         0         0
One year                     0      1473         0
Two year                     0         0      1695

In [78]:
pd.crosstab(df_telco.internet_service_type, df_telco.internet_service_type)

internet_service_type   DSL  Fiber optic  None
internet_service_type
DSL                    2421            0     0
Fiber optic               0         3096     0
None                      0            0  1526

In [74]:
df_telco = df_telco.drop(columns =['contract_type_id', 'internet_service_type_id', 'payment_type_id']) # drop the payment_type_id

In [79]:
df_telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            7043 non-null   object
 1   gender                 7043 non-null   object
 2   senior_citizen         7043 non-null   int64
 3   partner                7043 non-null   object
 4   dependents             7043 non-null   object
 5   tenure                 7043 non-null   int64
 6   phone_service          7043 non-null   object
 7   multiple_lines         7043 non-null   object
 8   online_security        7043 non-null   object
 9   online_backup          7043 non-null   object
 10  device_protection      7043 non-null   object
 11  tech_support           7043 non-null   object
 12  streaming_tv           7043 non-null   object
 13  streaming_movies       7043 non-null   object
 14  paperless_billing      7043 non-null   object
 15  monthly_charges        7043 non-null   float64
 16  total_charges          7043 non-null   object
 17  churn                  7043 non-null   object
 18  contract_type          7043 non-null   object
 19  internet_service_type  7043 non-null   object
 20  payment_type           7043 non-null   object
dtypes: float64(1), int64(2), object(18)
memory usage: 1.2+ MB

In [81]:
df_telco.gender.map({'Female': 1, 'Male' : 0})

0       1
1       0
2       0
3       0
4       1
       ..
7038    1
7039    0
7040    0
7041    0
7042    0
Name: gender, Length: 7043, dtype: int64

In [84]:
dummy_df = pd.get_dummies(df_telco[['gender','churn', 'phone_service', 'tech_support', 'paperless_billing', 'partner', 'dependents', ]], dummy_na=False, drop_first=[True, True])

In [85]:
# Concatenate the dummy_df dataframe above with the original df and validate.

df_telco = pd.concat([df_telco, dummy_df], axis=1)
df_telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,phone_service_Yes,tech_support_No internet service,tech_support_Yes,paperless_billing_Yes,gender_Male,churn_Yes,phone_service_Yes,tech_support_No internet service,tech_support_Yes,paperless_billing_Yes
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,1,0,1,1,0,0,1,0,1,1
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,1,0,0,0,1,0,1,0,0,0
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,1,0,0,1,1,1,1,0,0,1
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,1,0,0,1,1,1,1,0,0,1
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,1,0,1,1,0,1,1,0,1,1

In [87]:
df_telco = df_telco.total_charges.str.replace(' ', '0').astype(float)

In [88]:
df_telco.head()

0     593.30
1     542.40
2     280.85
3    1237.85
4     267.40
Name: total_charges, dtype: float64

    3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [20]:
# Concatenate the dummy_df dataframe above with the original df and validate.

df_telco = pd.concat([df_telco, dummy_df], axis=1)
df_telco.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,churn_Yes,phone_service_Yes,tech_support_No internet service,tech_support_Yes,paperless_billing_Yes,churn_Yes,phone_service_Yes,tech_support_No internet service,tech_support_Yes,paperless_billing_Yes
0,2,1,2,0002-ORFBO,0,Yes,Yes,9,Yes,No,...,0,1,0,1,1,0,1,0,1,1
1,2,1,1,0003-MKNFE,0,No,No,9,Yes,Yes,...,0,1,0,0,0,0,1,0,0,0
2,1,2,1,0004-TLHLJ,0,No,No,4,Yes,No,...,1,1,0,0,1,1,1,0,0,1
3,1,2,1,0011-IGKFF,1,Yes,No,13,Yes,No,...,1,1,0,0,1,1,1,0,0,1
4,2,2,1,0013-EXCHZ,1,Yes,No,3,Yes,No,...,1,1,0,1,1,1,1,0,1,1

    4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [76]:
# This will clean the data. 
def prep_telco(df_telco):
    '''
    This function will clean the the telco dataset
    '''
    df_telco = df_telco.drop(columns =['contract_type_id', 'internet_service_type_id', 'payment_type_id'])
    dummy_df = pd.get_dummies(df_telco[['gender', 'churn', 'phone_service', 'tech_support', 'paperless_billing']], dummy_na=False, drop_first=[True, True])
    df_telco = df_telco.drop(columns='gender')
    df_telco = pd.concat([df_telco, dummy_df], axis=1)
    return df_telco

In [ ]:
fresh_df_telco = acq.df_telco_data

In [16]:
df_telco.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [17]:
prep_telco(df_telco)

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,paperless_billing,monthly_charges,total_charges,churn,gender_Male,churn_Yes,phone_service_Yes,tech_support_No internet service,tech_support_Yes,paperless_billing_Yes
0,2,1,2,0002-ORFBO,0,Yes,Yes,9,Yes,No,...,Yes,65.60,593.3,No,0,0,1,0,1,1
1,2,1,1,0003-MKNFE,0,No,No,9,Yes,Yes,...,No,59.90,542.4,No,1,0,1,0,0,0
2,1,2,1,0004-TLHLJ,0,No,No,4,Yes,No,...,Yes,73.90,280.85,Yes,1,1,1,0,0,1
3,1,2,1,0011-IGKFF,1,Yes,No,13,Yes,No,...,Yes,98.00,1237.85,Yes,1,1,1,0,0,1
4,2,2,1,0013-EXCHZ,1,Yes,No,3,Yes,No,...,Yes,83.90,267.4,Yes,0,1,1,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2,1,2,9987-LUTYD,0,No,No,13,Yes,No,...,No,55.15,742.9,No,0,0,1,0,1,0
7039,1,2,1,9992-RRAMN,0,Yes,No,22,Yes,Yes,...,Yes,85.10,1873.7,Yes,1,1,1,0,0,1
7040,2,1,1,9992-UJOEL,0,No,No,2,Yes,No,...,Yes,50.30,92.75,No,1,0,1,0,0,1
7041,2,1,3,9993-LHIEB,0,Yes,Yes,67,Yes,No,...,No,67.85,4627.65,No,1,0,1,0,1,0
7042,1,1,3,9995-HOTOH,0,Yes,Yes,63,No,No phone service,...,No,59.00,3707.6,No,1,0,0,0,0,0

# Split your data

    1. Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

In [96]:
def split_fucntion(df_telco, target_variable):
    train, test = train_test_split(df_telco,
                random_state=123,
                test_size=.20,
                stratify = target_variable)
    
        train, validate = train_test_split(df_iris,
                random_state=123,
                test_size=.20,
                stratify = target_variable)
        
    return train, validate, test

IndentationError: unexpected indent (2255120370.py, line 7)

In [94]:
target = 'species'

In [ ]:
train_split_fucntion(df_iris, target)

In [95]:
split_fucntion(df_iris, target)

TypeError: Singleton array array('species', dtype='<U7') cannot be considered a valid collection.

    2. Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

    3. Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

In [ ]:
df_titanic.head()

In [39]:
train, validate, test= split_titanic(df_titanic)

In [40]:
# Observe split
print(f'Prepared df: {df_titanic.shape}')
print()
print(f'Train: {train.shape}')
print(f'Test: {test.shape}')

Prepared df: (891, 13)

Train: (534, 13)
Test: (179, 13)

    4. Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [41]:
df_telco.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [36]:
train, validate, test= split_telco(df_telco)

In [38]:
# Observe split
print(f'Prepared df_telco: {df_telco.shape}')
print()
print(f'Train: {train.shape}')
print(f'Test: {test.shape}')

Prepared df: (7043, 24)

Train: (4225, 24)
Test: (1409, 24)